#include "includes.h"

/**************************************************************************************
* 名    称: 
* 功    能: 
* 参    数: 
* 返 回 值: 
*
* 修改历史:
*   版本    日期     作者     
*   ----------------------------------------------------
*   1.0   2010.3.22  田友建       www.http://shop34333066.taobao.com
**************************************************************************************/ 
void touch_Init(void)
{
    TOUCH_CS_H();
    TOUCH_CLK_H();
    TOUCH_DIN_H();
}
/**************************************************************************************
* 名    称: 
* 功    能: 
* 参    数: 
* 返 回 值: 
*
* 修改历史:
*   版本    日期     作者     
*   ----------------------------------------------------
*   1.0   2010.3.22  田友建       www.http://shop34333066.taobao.com
**************************************************************************************/  
static unsigned short RD_AD(void) 
{
    uint temp=0;
    uchar i;
    TOUCH_DIN_L();
    TOUCH_CLK_H();
    for(i=0;i<12;i++) 
    {
        TOUCH_CLK_L();         
 		temp<<=1;
        if( TOUCH_DOUT_RD() ) 
            temp++;
        TOUCH_CLK_H();
    }
    TOUCH_CS_H();
    return(temp);
}
/**************************************************************************************
* 名    称: 
* 功    能: 
* 参    数: 
* 返 回 值: 
*
* 修改历史:
*   版本    日期     作者     
*   ----------------------------------------------------
*   1.0   2010.3.22  田友建       www.http://shop34333066.taobao.com
**************************************************************************************/ 
uint read_trouch (unsigned char cmd) 
{
    unsigned char i;
    TOUCH_CS_H();
    TOUCH_DIN_L();
    TOUCH_CLK_L();
    TOUCH_CS_L();
    for(i=0;i<8;i++) 
    {
        if(cmd&0x80) TOUCH_DIN_H();
        else TOUCH_DIN_L();
        cmd=cmd<<1;
        TOUCH_CLK_H();
        TOUCH_CLK_L();
    }
	return RD_AD();
}
/**************************************************************************************
* 名    称: 
* 功    能: 
* 参    数: 
* 返 回 值: 
*
* 修改历史:
*   版本    日期     作者     
*   ----------------------------------------------------
*   1.0   2010.3.22  田友建       www.http://shop34333066.taobao.com
**************************************************************************************/ 
 void touch_GetAdXY(uint *x,uint *y) 
{
    *x=read_trouch(CHX);
    *y=read_trouch(CHY);
}
